//****************************************************
//****************************************************
	//最小系统液晶转接板LCD12864测试程序
//****************************************************
//****************************************************
#include "main.h"
#include "LCD12864.h"

//定义变量

//****************************************************
//主函数
//****************************************************
void main()
{
	LCD12864_Reset();								//初始化液晶
	LCD12864_HAIZI_SET();							//设置为普通模式
	
	Delay_ms(100);

	LCD12864_NoWaitIdle_COM_Write(0x80);			//设置指针
	LCD12864_write_word("别人笑我太疯癫，");				//显示内容
	LCD12864_NoWaitIdle_COM_Write(0x90);			//设置指针
	LCD12864_write_word("我笑他人看不穿。");			//显示内容
	LCD12864_NoWaitIdle_COM_Write(0x88);			//设置指针
	LCD12864_write_word("不见五陵豪杰墓，");		//显示内容
	LCD12864_NoWaitIdle_COM_Write(0x98);			//设置指针
	LCD12864_write_word("无花无酒锄作田。");				//显示内容
	while(1)
	{
		
	}
}
//****************************************************
//MS延时函数(12M晶振下测试)
//****************************************************
void Delay_ms(unsigned int n)
{
	unsigned int  i,j;
	for(i=0;i<n;i++)
		for(j=0;j<123;j++);
}