//****************************************************
//****************************************************
		//小强电子最小系统液晶转接板例程
//****************************************************
//****************************************************
#include "main.h"
#include "LCD1602.h"

//****************************************************
//主函数
//****************************************************
void main()
{
	Init_LCD1602();									//初始化LCD1602
	LCD1602_write_com(0x80);						//指针设置到第一行
	LCD1602_write_word("Welcome to use!");			//显示内容
	LCD1602_write_com(0x80+0x40+5);				//指针设置到第二行
	LCD1602_write_word("Beetle v0.1");						//显示内容
	while(1)
	{
		LED1 = 0;			 //LED1点亮
		LED2 = 1;			 //LED2熄灭
		Delay_ms(1000);		 //延时1s
		LED1 = 1;			 //LED1熄灭
		LED2 = 0;			 //LED2点亮
		Delay_ms(1000);		 //延时1s		
	}
}

//****************************************************
//MS延时函数(12M晶振下测试)
//****************************************************
void Delay_ms(unsigned int n)
{
	unsigned int  i,j;
	for(i=0;i<n;i++)
		for(j=0;j<123;j++);
}