
/*------------------------------------------------------------------*/
/* --- STC MCU International Limited -------------------------------*/
/* --- STC 1T Series MCU Programme Demo ----------------------------*/
/* --- Fax: 86-755-82944243 ----------------------------------------*/
/* --- Tel: 86-755-82948412 ----------------------------------------*/
/* --- Web: www.STCMCU.com -----------------------------------------*/
/* If you want to use the program or the program referenced in the  */
/* article, please specify in which data and procedures from STC    */
/*------------------------------------------------------------------*/

/*      本程序经过测试完全正常, 不提供电话技术支持, 如不能理解, 请自行补充相关基础.  */


/*************	本程序功能说明	**************

INT0 INT1 测试程序。

******************************************/

#include	<reg52.h>

sbit	P10 = P1^0;
sbit	P11 = P1^1;


/********************* 主函数 *************************/
void main(void)
{
	IT0 = 1;	// 外部中断0下降沿中断
	EX0 = 1;	// 外部中断0允许
//	IT1 = 1;	// 外部中断1下降沿中断
//	EX1 = 1;	// 外部中断1允许

	EA = 1;		//允许所有中断

	while(1)
	{

	}
}


void INT0_int (void) interrupt 0
{
	P10 = ~P10;		//中断里取反一个IO, 输出中断信号的2分频
}

void INT1_int (void) interrupt 2
{
	P11 = ~P11;		//中断里取反一个IO, 输出中断信号的2分频
}
