
/*------------------------------------------------------------------*/
/* --- STC MCU International Limited -------------------------------*/
/* --- STC 1T Series MCU Programme Demo ----------------------------*/
/* --- Fax: 86-755-82944243 ----------------------------------------*/
/* --- Tel: 86-755-82948412 ----------------------------------------*/
/* --- Web: www.STCMCU.com -----------------------------------------*/
/* If you want to use the program or the program referenced in the  */
/* article, please specify in which data and procedures from STC    */
/*------------------------------------------------------------------*/

/*      本程序经过测试完全正常, 不提供电话技术支持, 如不能理解, 请自行补充相关基础.  */


/*************	本程序功能说明	**************

	测试P4.4 P4.5 P4.6做IO输出方波。

****************************************************/

#include	<reg51.h>

sfr   P4    = 0xC0;
sfr   P4SW  = 0xBB;
sfr   P4M1  = 0xB3;	//P4M1.n,P4M0.n 	=00--->Standard,	01--->push-pull
sfr   P4M0  = 0xB4;	//					=10--->pure input,	11--->open drain

sbit  P44   = P4^4;
sbit  P45   = P4^5;
sbit  P46   = P4^6;
sbit  P47   = P4^7;

void	main(void)
{
	unsigned int i;

	P4SW |= (1<<4);		//P4.4允许设置成IO
	P4SW |= (1<<5);		//P4.5允许设置成IO
	P4SW |= (1<<6);		//P4.6允许设置成IO

	P4M1 &= ~(1<<4);	//P4.4设置成准双向IO
	P4M0 &= ~(1<<4);
	P4M1 &= ~(1<<5);	//P4.5设置成准双向IO
	P4M0 &= ~(1<<5);
	P4M1 &= ~(1<<6);	//P4.6设置成准双向IO
	P4M0 &= ~(1<<6);
//	P4M1 &= ~(1<<7);	//P4.7设置成PUSH-PULL	要在下在时指定RESET pin用做P4.7，并且使用外部晶体时钟
//	P4M0 |=  (1<<7);

	
	while(1)
	{
		for(i=0; i<1000; i++)	;	//延时
		
		P44 = ~P44;		//取反输出方波
		P45 = ~P45;
		P46 = ~P46;
//		P47 = ~P47;		//要在下载时指定RESET pin用做P4.7，并且使用外部晶体时钟
	}
}

