//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//中景园电子
//店铺地址：http://shop73023976.taobao.com/?spm=2013.1.0.0.M4PqC2
//
//  文 件 名   : main.c
//  版 本 号   : v2.0
//  作    者   : HuangKai
//  生成日期   : 2014-0101
//  最近修改   : 
//  功能描述   : OLED IIC接口演示例程(51系列)
//              说明: 
//              ----------------------------------------------------------------
//              GND    电源地
//              VCC  接5V或3.3v电源
//              D0   P1^0（SCL）
//              D1   P1^1（SDA）
//              RES  接高
//              DC   接地
//              CS   接地                
//              ----------------------------------------------------------------
// 修改历史   :
// 日    期   : 
// 作    者   : HuangKai
// 修改内容   : 创建文件
//版权所有，盗版必究。
//Copyright(C) 中景园电子2014/3/16
//All rights reserved
//******************************************************************************/

#include "reg52.h"

#include "oled.h"

/*******************************Main*******************************/
void main(void)
{
	Initial_M096128x64_ssd1306();
	Delay_1ms(5);
	while(1)
	{
		fill_picture(0xff);//全屏显示
		Delay_50ms(25);
		fill_picture(0xf0);//半屏熄灭；出现一条一条的亮线
		Delay_50ms(25);
		Picture();//显示一张图片
		Delay_50ms(25);
	}
}

